<h1 style="text-align:center; color:red;">Exercise XP</h1>

<h1 style="text-align:left; color:green;">Exercise 1: Identifying Data Types
</h1>

- A companyâ€™s financial reports stored in an Excel file. --> structured data
- Photographs uploaded to a social media platform. --> unstructured data
- A collection of news articles on a website. --> unstructured data
- Inventory data in a relational database. --> structured data
- Recorded interviews from a market research study. --> unstructured data

<h1 style="text-align:left; color:green;">Exercise 2: Transformation Exercise
</h1>

Purpose : suggest a method to transform into a structured data

### A series of blog posts about travel experiences.- method : NLP (Natural Language Processing)
- Why? Blog posts are texts (unstructered data), with NLP we can transform raw text into tables or JSON with meaningful attributes.
- How? Use text cleaning, tokenization, and named entity recognition(NER) with Scipy, in consequence, wa can extract structred fields like destination, dates, activities, sentiment and costs.ng.

### Audio recordings of customer service calls.
- method : Speech to text  + NLP
- Why? audios can't be analyzed as structured data, Transcription enables further structuring
- analysis.
- How? convert audio to text using speech recognition and apply NLP to identify issues, keywords, call duration, customer sentiment

### Handwritten notes from a brainstorming session.
- method: OCR (Optical character Recognition) + text processing
- Why? handwritten content must be digitized first. OCR transform it into text that can be then structured
- How? use OCR to digitize notes and organize content into ideas, themes, action items.

### A video tutorial on cooking.
- method: Computer vision + speech to text
- Why? videos combine visual and audio data. we use computer vision to analyse frames and use the transcription to anlyse tructered data.
- How? Extract audio and transcribe spoken instructions, also use computer visio to detect ingredients, steps, timestamps.

<h1 style="text-align:left; color:green;">Exercise 3 : Import a file from Kaggle
</h1>

In [36]:
import pandas as pd
df = pd.read_csv(r"C:\Users\pc\Downloads\train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<h1 style="text-align:left; color:green;">Exercise 4: Importing a CSV File
</h1>

In [46]:
df = pd.read_csv("Iris_dataset.csv", header = None)
df.head()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

<h1 style="text-align:left; color:green;">Exercise 5 : Export a dataframe to excel format and JSON format</h1>

In [63]:
import numpy as np
arr = np.array([i for i in range(5)]*4).reshape(5,4)
arr

array([[0, 1, 2, 3],
       [4, 0, 1, 2],
       [3, 4, 0, 1],
       [2, 3, 4, 0],
       [1, 2, 3, 4]])

In [67]:
df = pd.DataFrame(arr)
df

   0  1  2  3
0  0  1  2  3
1  4  0  1  2
2  3  4  0  1
3  2  3  4  0
4  1  2  3  4

In [69]:
df.to_json('filename.json')
df.to_csv('filename.csv', index=False)
df.to_excel('filename.xlsx', sheet_name='Sheet1')

<h1 style="text-align:left; color:green;">Exercise 6: Reading JSON Data
</h1>

In [73]:
df = pd.read_json(r"C:\Users\pc\Downloads\posts.json")
df.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...